app/Controllers/Home.php

SELECT *
FROM `auth_groups_users`
WHERE `user_id` = 3
SELECT *
FROM `custom_roles`
WHERE `role_name` IN ('admin')
SELECT *
FROM `custom_roles_permissions`
WHERE `role_id` IN ('4')
---
    public function index()
    {
        // 1. Amankan halaman. Jika belum login, paksa seret ke halaman login Shield
        if (!auth()->loggedIn()) {
            return redirect()->to('login');
        }

        $db = \Config\Database::connect();
        $user = auth()->user();

        // 2. Ambil semua kode peran/grup yang dimiliki oleh user ini (Multi-Role Support)
        $userGrupRaw = $db->table('auth_groups_users')
                           ->where('user_id', $user->id)
                           ->get()
                           ->getResultArray();

        $myRoles = array_column($userGrupRaw, 'group');

        $menusAllowed = [];

        if (!empty($myRoles)) {
            // 3. Cari ID Peran kustom yang cocok dengan nama grup user tersebut
            $roleData = $db->table('custom_roles')
                           ->whereIn('role_name', $myRoles)
                           ->get()
                           ->getResultArray();
            $myRoleIds = array_column($roleData, 'id');

            if (!empty($myRoleIds)) {
                // 4. Tarik semua ID Permission (Menu) yang telah dicentang oleh Admin di halaman matriks
                $permissionData = $db->table('custom_roles_permissions')
                                     ->whereIn('role_id', $myRoleIds)
                                     ->get()
                                     ->getResultArray();

SELECT *
FROM `custom_permissions`
WHERE `id` IN ('1','2','3','4','5','6','7','8','9','10','11','12','13','14')
---

                if (!empty($myPermissionIds)) {
                    // 5. Ambil data menu utuh berdasarkan ID yang diizinkan
                    $menusAllowed = $db->table('custom_permissions')
                                      ->whereIn('id', $myPermissionIds)
                                      ->get()
                                      ->getResultArray();