app/Controllers/KaldikController.php

SELECT *
FROM `academic_years`
WHERE `is_active` = 1
SELECT *
FROM `master_classes`
SELECT *
FROM `master_categories`
SELECT `ac`.*, `mc`.`category_name`, `mc`.`color_hex`, `ac`.`category_id`
FROM `academic_calendars` `ac`
JOIN `master_categories` `mc` ON `mc`.`id` = `ac`.`category_id`
WHERE `ac`.`academic_year_id` = '2'
AND `ac`.`class_id` = '2'
ORDER BY `ac`.`start_date` ASC
---
    public function index()
    {
        $db = \Config\Database::connect();

        // 1. Ambil Tahun Pelajaran & Semester yang berstatus AKTIF saat ini
        $tahunAktif = $db->table('academic_years')->where('is_active', 1)->get()->getRowArray();

        // 2. Ambil parameter pilihan filter Kelas dan Jenjang (Default ke Kelas 7 jika belum dipilih)
        $kelasTerpilih = $this->request->getGet('class_id') ?? 1; // ID 1 = Kelas 7

        // 3. Tarik data master komponen untuk dropdown menu pilihan di View
        $daftarKelas = $db->table('master_classes')->get()->getResultArray();
        $daftarWarna = $db->table('master_categories')->get()->getResultArray();

        // [TAMBAHAN BARU]: Ambil opsi hari kerja dari tabel settings (Fallback default ke 5 jika kosong)
        $hariKerjaSetting = 5;
        if ($db->tableExists('settings')) {
            $getSetting = $db->table('settings')->where('key', 'kaldik_hari_kerja')->get()->getRowArray();
            if ($getSetting) {
                $hariKerjaSetting = (int)$getSetting['value'];
            }
        }

        // 4. Tarik data agenda Kaldik yang sudah diploting berdasarkan tahun aktif dan kelas terpilih
        $agendaKaldik = [];
        if ($tahunAktif) {
            $agendaKaldik = $db->table('academic_calendars ac')
                   ->select('ac.*, mc.category_name, mc.color_hex, ac.category_id')
                   ->join('master_categories mc', 'mc.id = ac.category_id')
                   ->where('ac.academic_year_id', $tahunAktif['id'])
                   ->where('ac.class_id', $kelasTerpilih)
                   ->orderBy('ac.start_date', 'ASC')
                   ->get()
                   ->getResultArray();

INSERT INTO `academic_calendars` (`academic_year_id`, `class_id`, `category_id`, `start_date`, `end_date`, `event_name`, `created_at`, `updated_at`) VALUES ('2', '1', '5', '2026-01-22', '2026-01-23', 'LDKS (Latihan Dasar Kepemimpinan Siswa)', '2026-05-19 15:36:00', '2026-05-19 15:36:00')
---
    public function storeAgenda()
    {
        $db = \Config\Database::connect();

        $dataInsert = [
            'academic_year_id' => $this->request->getPost('academic_year_id'),
            'class_id'         => $this->request->getPost('class_id'),
            'category_id'      => $this->request->getPost('category_id'),
            'start_date'       => $this->request->getPost('start_date'),
            'end_date'         => $this->request->getPost('end_date'), // Mendukung rentang tanggal dokumen MIMHa
            'event_name'       => $this->request->getPost('event_name'),
            'created_at'       => date('Y-m-d H:i:s'),
            'updated_at'       => date('Y-m-d H:i:s')
        ];

        $db->table('academic_calendars')->insert($dataInsert);

UPDATE `academic_calendars` SET `category_id` = '4', `start_date` = '2026-01-01', `end_date` = '2026-01-01', `event_name` = 'Asesmen', `updated_at` = '2026-05-19 15:25:38'
WHERE `id` = '7'
---
    public function updateAgenda()
    {
        $db = \Config\Database::connect();
        $id = $this->request->getPost('agenda_id');
        $classId = $this->request->getPost('class_id');

        $dataUpdate = [
            'category_id' => $this->request->getPost('category_id'),
            'start_date'  => $this->request->getPost('start_date'),
            'end_date'    => $this->request->getPost('end_date'),
            'event_name'  => $this->request->getPost('event_name'),
            'updated_at'  => date('Y-m-d H:i:s')
        ];

        $db->table('academic_calendars')->where('id', $id)->update($dataUpdate);

DELETE FROM `academic_calendars`
WHERE `id` = '14'
---
    public function deleteAgenda($id)
    {
        $db = \Config\Database::connect();
        $classId = $this->request->getGet('class_id') ?? 1;

        $db->table('academic_calendars')->where('id', $id)->delete();